## Series

`Series` - это одна из структур данных библиотеки `pandas`. Она представляет собой что-то вроде словаря, однако, является упорядоченной.

In [113]:
import pandas as pd 
import numpy as np

In [114]:
a = [2, 5, 7, 8, 3]

In [115]:
# создадим на основе этих данных обьект Series
d = pd.Series(a)
d

0    2
1    5
2    7
3    8
4    3
dtype: int64

In [6]:
# индексы можно задать явно это могут быть цифры или символы
d = pd.Series(a, index = [0, 1, 8, 3, 4])
d

0    2
1    5
8    7
3    8
4    3
dtype: int64

In [7]:
d = pd.Series(a, index = ['q', 'w', 'e', 'r', 't'])
d

q    2
w    5
e    7
r    8
t    3
dtype: int64

In [8]:
#время вместо индекса
from datetime import date

In [9]:
ind = [date(y, m, d) for y, m, d in [(2018, 12, 28), (1921, 4, 12), (2024, 8, 19), (2012, 6, 25), (1991, 11, 28)]]

In [10]:
b = pd.Series(a, index = ind)
b

2018-12-28    2
1921-04-12    5
2024-08-19    7
2012-06-25    8
1991-11-28    3
dtype: int64

In [11]:
b.index

Index([2018-12-28, 1921-04-12, 2024-08-19, 2012-06-25, 1991-11-28], dtype='object')

In [12]:
# преобразуем формат с помощю функции пандаса 
b.index = pd.to_datetime(b.index, format = '%Y-%m-%d')
b.index

DatetimeIndex(['2018-12-28', '1921-04-12', '2024-08-19', '2012-06-25',
               '1991-11-28'],
              dtype='datetime64[ns]', freq=None)

In [13]:
b.index.year

Index([2018, 1921, 2024, 2012, 1991], dtype='int32')

In [14]:
b.index.month

Index([12, 4, 8, 6, 11], dtype='int32')

In [15]:
b.index.day

Index([28, 12, 19, 25, 28], dtype='int32')

индексы могут быть не уникальны

In [16]:
b = pd.Series(a, index = [0, 1, 0, 2, 1])
b

0    2
1    5
0    7
2    8
1    3
dtype: int64

можно поменять индексы с помощью атрибута index

In [17]:
b.index = [10, 11, 12, 13, 14]
b

10    2
11    5
12    7
13    8
14    3
dtype: int64

In [18]:
#задаем тип данных
b = pd.Series(a, dtype = np.float64)
b

0    2.0
1    5.0
2    7.0
3    8.0
4    3.0
dtype: float64

In [19]:
# меняем уже имеющийся тип с помощю astype
b = pd.Series(a)
b = b.astype(np.float64)
b

0    2.0
1    5.0
2    7.0
3    8.0
4    3.0
dtype: float64

In [20]:
# создаем Series  из словарей
d = {'1st':'a', '2nd':'b', '3rd':'c', '4th':'d', '5th':'e'}

все ключи становятся индексами а значения данными

In [21]:
b = pd.Series(d)
b

1st    a
2nd    b
3rd    c
4th    d
5th    e
dtype: object

Просмотр данных

In [22]:
b = pd.Series([1, 2, 3, 4, 5, 6, 7])

In [23]:
#смотрим индексы
b.index

RangeIndex(start=0, stop=7, step=1)

In [24]:
#просмотр данных в виде массива Numpy
b.values

array([1, 2, 3, 4, 5, 6, 7], dtype=int64)

In [25]:
#доступ по списку индексов
b[[0,6]]

0    1
6    7
dtype: int64

все остальное аналогично словарям

In [26]:
#доступ с помощью head - первые с головы,tail - последние с жепы))
b.head

<bound method NDFrame.head of 0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64>

In [27]:
b.tail(2)

5    6
6    7
dtype: int64

выборка по условию

In [28]:
b

0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [29]:
b[b>5]

5    6
6    7
dtype: int64

In [30]:
b[(b == 7) | (b % 3 == 0)] # также  оператор &

2    3
5    6
6    7
dtype: int64

Изменение элементов
производится также как в словарях пайтон

In [31]:
b = pd.Series([1, 4, 7, 8, 9, 10, 11])
b

0     1
1     4
2     7
3     8
4     9
5    10
6    11
dtype: int64

In [32]:
b[0] = 4
b

0     4
1     4
2     7
3     8
4     9
5    10
6    11
dtype: int64

In [33]:
b[b < 5] = 0
b

0     0
1     0
2     7
3     8
4     9
5    10
6    11
dtype: int64

In [34]:
b[[0, 1, 2,]] = 1
b

0     1
1     1
2     1
3     8
4     9
5    10
6    11
dtype: int64

добавление данных

In [35]:
b = b._append(pd.Series({6:10, 8:11, 9:15}))
b

0     1
1     1
2     1
3     8
4     9
5    10
6    11
6    10
8    11
9    15
dtype: int64

Удаление данных drop

In [36]:
b = b.drop([0, 1, 2]) # указываем индексы оьектов которые хотим удалить
b

3     8
4     9
5    10
6    11
6    10
8    11
9    15
dtype: int64

запись и чтение данных из файла

In [37]:
b

3     8
4     9
5    10
6    11
6    10
8    11
9    15
dtype: int64

In [38]:
b.to_pickle('b.pkl') #сохраняем свой формат pkl

In [39]:
b2 = pd.read_pickle('b.pkl')

In [40]:
b2

3     8
4     9
5    10
6    11
6    10
8    11
9    15
dtype: int64

## Структура данных DataFrame

In [41]:
# создадим dataFrame - двумерная структура данных библиотек Pandas
df = pd.DataFrame({'col1':['a','b','c','d','e','f','g','h'],
                   'col2':[1, 3, 5, 7, 9, 11, 13, 15]}, columns=['col1', 'col2'])
df

  col1  col2
0    a     1
1    b     3
2    c     5
3    d     7
4    e     9
5    f    11
6    g    13
7    h    15

просмотор информации о df

In [42]:
df.shape

(8, 2)

восемь строк два столбца

In [43]:
df.columns # смотрим список столбцов

Index(['col1', 'col2'], dtype='object')

In [44]:
df.index

RangeIndex(start=0, stop=8, step=1)

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    8 non-null      object
 1   col2    8 non-null      int64
dtypes: int64(1), object(1)
memory usage: 260.0+ bytes

In [46]:
df.describe()

            col2
count   8.000000
mean    8.000000
std     4.898979
min     1.000000
25%     4.500000
50%     8.000000
75%    11.500000
max    15.000000

In [47]:
df.head()

  col1  col2
0    a     1
1    b     3
2    c     5
3    d     7
4    e     9

In [48]:
df['col1'].head()

0    a
1    b
2    c
3    d
4    e
Name: col1, dtype: object

In [49]:
df.col1.head()

0    a
1    b
2    c
3    d
4    e
Name: col1, dtype: object

изменения индекса

In [50]:
df.index = [2, 4, 6, 8, 10, 12, 14, 16]
df

   col1  col2
2     a     1
4     b     3
6     c     5
8     d     7
10    e     9
12    f    11
14    g    13
16    h    15

выбор данных по индексу

In [51]:
df.loc[2, 'col1'] # [индекс, 'col1']

'a'

In [52]:
df.loc[2, :] # двоеточие выбрать все столбцы

col1    a
col2    1
Name: 2, dtype: object

In [53]:
df.loc[2 : 4, :] # выбираются все строки от двух до 4 включительно

  col1  col2
2    a     1
4    b     3

выбор данных по позициям iloc

In [54]:
df

   col1  col2
2     a     1
4     b     3
6     c     5
8     d     7
10    e     9
12    f    11
14    g    13
16    h    15

In [55]:
df.iloc[0, :]

col1    a
col2    1
Name: 2, dtype: object

In [56]:
df.iloc[0:2, :]

  col1  col2
2    a     1
4    b     3

In [57]:
df.iloc[0:2, 0]

2    a
4    b
Name: col1, dtype: object

выбор по условию

In [58]:
df.loc[df['col1'] == 'b', :] # выводим значение всех строк где в первом столбце есть значение b

  col1  col2
4    b     3

In [59]:
df.loc[df['col1'] == 'b', 'col2'] # делаем все тоже самое но выводим значение только с второго столбца

4    3
Name: col2, dtype: int64

values - просмотр в виде многомерного массива numpy

In [60]:
df.loc[df['col1'] == 'b', 'col2'].values

array([3], dtype=int64)

In [61]:
df.loc[df['col2'] >10, 'col1']

12    f
14    g
16    h
Name: col1, dtype: object

операторы & и | или условие в круглых скобках

In [62]:
df.loc[(df['col2'] > 10) & (df['col1'] != 'g'), :]

   col1  col2
12    f    11
16    h    15

In [63]:
df.loc[(df['col2'] > 10) | (df['col2'] % 9 == 0), :]

   col1  col2
10    e     9
12    f    11
14    g    13
16    h    15

between - задать отрезок которму долен соттветствоввать столбец

In [64]:
df.loc[df['col2'].between(11,13), :]

   col1  col2
12    f    11
14    g    13

метод isin  - вывести конкретные елементы

In [65]:
df.loc[df['col1'].isin(['a', 'b', 'c', 'd', 'e', 'f']), :]

   col1  col2
2     a     1
4     b     3
6     c     5
8     d     7
10    e     9
12    f    11

с помощю тильды ~ задаем отрицание и вывод наоборот где не cодержаться заданные параметры

In [66]:
df.loc[~df['col1'].isin(['a', 'b', 'c', 'd', 'e', 'f']), :]

   col1  col2
14    g    13
16    h    15

лучше использовать метод query для простых условий для более слоных использовать loc

In [67]:
df.query('col1 == "b"')

  col1  col2
4    b     3

In [68]:
df.query('col2 > 10')

   col1  col2
12    f    11
14    g    13
16    h    15

сьтолбец DataFrame в виде Series

In [69]:
s = df['col1'] # когда выбираем один столбец получаем структуру данных series
s

2     a
4     b
6     c
8     d
10    e
12    f
14    g
16    h
Name: col1, dtype: object

In [70]:
type(s)

pandas.core.series.Series

In [71]:
# получаем df  из series
df2 = pd.DataFrame(s)
df2

   col1
2     a
4     b
6     c
8     d
10    e
12    f
14    g
16    h

In [72]:
# копирование df
df_copy = df.copy()
df_copy

   col1  col2
2     a     1
4     b     3
6     c     5
8     d     7
10    e     9
12    f    11
14    g    13
16    h    15

Слчайный выбор n-го количества строк

In [73]:
df.sample(n = 5)

   col1  col2
4     b     3
2     a     1
8     d     7
12    f    11
10    e     9

случайный выбор доли от исходного датафрейма 0.5 половина

In [74]:
df.sample(frac = 0.5)

   col1  col2
4     b     3
10    e     9
14    g    13
8     d     7

случайный выбор с возвращением(строки могут повторятся)

In [75]:
df.sample(frac = 0.5, replace=True)

   col1  col2
2     a     1
10    e     9
4     b     3
4     b     3

случайное перемешивание

In [76]:
# random.state значения цифры инициализации псевдовыборки
# нужна для воспроизводимости рандома
df.sample(frac = 1.0, random_state = 42)

   col1  col2
4     b     3
12    f    11
2     a     1
16    h    15
6     c     5
10    e     9
8     d     7
14    g    13

запись и чтения DataFrame
аналогично для excell and pickle

In [77]:
#Запись. sep = разделитель
df.to_csv('Test.csv', sep = ';', index = False)

In [78]:
# ччтение 
df.new = pd.read_csv('Test.csv', sep = ';')
df.new

C:\Users\ramze\AppData\Local\Temp\ipykernel_2124\928505224.py:2: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  df.new = pd.read_csv('Test.csv', sep = ';')

  col1  col2
0    a     1
1    b     3
2    c     5
3    d     7
4    e     9
5    f    11
6    g    13
7    h    15

Слияние данных

In [79]:
authors = pd.DataFrame({'author_id' : [1, 2, 3], 'author_name' : ['Pushkin', 'Tolstoy', 'Dostoevsky']},
columns = ['author_id', 'author_name'])
authors

   author_id author_name
0          1     Pushkin
1          2     Tolstoy
2          3  Dostoevsky

In [80]:
books = pd.DataFrame({'author_id' : [1, 2, 3, 4],
                     'books_title' : ['War and Peace','The Idiot', 'Crime and Punisment', 'Fathers and Sons']})

In [81]:
books

   author_id          books_title
0          1        War and Peace
1          2            The Idiot
2          3  Crime and Punisment
3          4     Fathers and Sons

Merge

In [82]:
# inner - отброс данных при слиянии в случае несовпадения строк 
# left - с левого df копируется все  правого только совпадения с левым.
# если невозможможно левый соеденить с правым по параметру on
# в итоговом будет nan
df1 = pd.merge(authors, books, on = 'author_id', how='inner')

In [83]:
df1

   author_id author_name          books_title
0          1     Pushkin        War and Peace
1          2     Tolstoy            The Idiot
2          3  Dostoevsky  Crime and Punisment

In [84]:
df2 = pd.merge(authors, books, on = 'author_id', how='left')
df2

   author_id author_name          books_title
0          1     Pushkin        War and Peace
1          2     Tolstoy            The Idiot
2          3  Dostoevsky  Crime and Punisment

In [85]:
df3 = pd.merge(authors, books, on = 'author_id', how='right')
df3

   author_id author_name          books_title
0          1     Pushkin        War and Peace
1          2     Tolstoy            The Idiot
2          3  Dostoevsky  Crime and Punisment
3          4         NaN     Fathers and Sons

In [86]:
#outer -  сливаются все строки пустые значения nan
df4 = pd.merge(authors, books, on = 'author_id', how='outer')
df4

   author_id author_name          books_title
0          1     Pushkin        War and Peace
1          2     Tolstoy            The Idiot
2          3  Dostoevsky  Crime and Punisment
3          4         NaN     Fathers and Sons

Работа с пропущенными данными

In [87]:
df4

   author_id author_name          books_title
0          1     Pushkin        War and Peace
1          2     Tolstoy            The Idiot
2          3  Dostoevsky  Crime and Punisment
3          4         NaN     Fathers and Sons

In [88]:
# смотрим пропущенные данные в столбце
df4.loc[df4['books_title'].isnull(), :]

Empty DataFrame
Columns: [author_id, author_name, books_title]
Index: []

In [89]:
# просмотр заполненных значений
df4.loc[df4['author_name'].notnull(), :]

   author_id author_name          books_title
0          1     Pushkin        War and Peace
1          2     Tolstoy            The Idiot
2          3  Dostoevsky  Crime and Punisment

In [90]:
# заполнение пустых значений 
df4['books_title'] = df4['books_title'].fillna('unknown')
df4

   author_id author_name          books_title
0          1     Pushkin        War and Peace
1          2     Tolstoy            The Idiot
2          3  Dostoevsky  Crime and Punisment
3          4         NaN     Fathers and Sons

In [91]:
df4['author_name'].fillna('unknown', inplace=True) # на месте
df4

C:\Users\ramze\AppData\Local\Temp\ipykernel_2124\4097230654.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df4['author_name'].fillna('unknown', inplace=True) # на месте

   author_id author_name          books_title
0          1     Pushkin        War and Peace
1          2     Tolstoy            The Idiot
2          3  Dostoevsky  Crime and Punisment
3          4     unknown     Fathers and Sons

добавления столбцов

In [92]:
df4.loc[(df4['author_name'] != 'unknown') & (df4['books_title'] != 'unknown'), 'quantity'] = 1
df4

   author_id author_name          books_title  quantity
0          1     Pushkin        War and Peace       1.0
1          2     Tolstoy            The Idiot       1.0
2          3  Dostoevsky  Crime and Punisment       1.0
3          4     unknown     Fathers and Sons       NaN

In [93]:
# заменяем nan нулями
df4['quantity'].fillna(0, inplace = True)
df4

C:\Users\ramze\AppData\Local\Temp\ipykernel_2124\889758626.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df4['quantity'].fillna(0, inplace = True)

   author_id author_name          books_title  quantity
0          1     Pushkin        War and Peace       1.0
1          2     Tolstoy            The Idiot       1.0
2          3  Dostoevsky  Crime and Punisment       1.0
3          4     unknown     Fathers and Sons       0.0

In [94]:
# меняем значение на целочисленное
df4['quantity'] =df4['quantity'].astype(int)
df4

   author_id author_name          books_title  quantity
0          1     Pushkin        War and Peace         1
1          2     Tolstoy            The Idiot         1
2          3  Dostoevsky  Crime and Punisment         1
3          4     unknown     Fathers and Sons         0

In [95]:
# set_index задает индекс столбцу
df4.set_index('author_id', inplace = True)
df4

          author_name          books_title  quantity
author_id
1             Pushkin        War and Peace         1
2             Tolstoy            The Idiot         1
3          Dostoevsky  Crime and Punisment         1
4             unknown     Fathers and Sons         0

In [96]:
df4.reset_index(inplace = True) #отмена
df4

   author_id author_name          books_title  quantity
0          1     Pushkin        War and Peace         1
1          2     Tolstoy            The Idiot         1
2          3  Dostoevsky  Crime and Punisment         1
3          4     unknown     Fathers and Sons         0

удаление данных

In [97]:
df4['price'] = 500
df4

   author_id author_name          books_title  quantity  price
0          1     Pushkin        War and Peace         1    500
1          2     Tolstoy            The Idiot         1    500
2          3  Dostoevsky  Crime and Punisment         1    500
3          4     unknown     Fathers and Sons         0    500

In [98]:
#удалим столбец
df4 = df4.drop('price', axis=1)
df4

   author_id author_name          books_title  quantity
0          1     Pushkin        War and Peace         1
1          2     Tolstoy            The Idiot         1
2          3  Dostoevsky  Crime and Punisment         1
3          4     unknown     Fathers and Sons         0

In [99]:
# удалим строку (index, axis=0 )
df4 = df4.drop(0, axis=0)
df4

   author_id author_name          books_title  quantity
1          2     Tolstoy            The Idiot         1
2          3  Dostoevsky  Crime and Punisment         1
3          4     unknown     Fathers and Sons         0

Сортировка

In [100]:
df4 = pd.concat([df4,pd.DataFrame({'index' : [0], 'author_id' : [1],
                                     'author_name' : ['Pushkin'],
                                     'books_title' : ['War and Peace'],
                                     'quantity' : [1]})],
                                  ignore_index=True) 
df4

   author_id author_name          books_title  quantity  index
0          2     Tolstoy            The Idiot         1    NaN
1          3  Dostoevsky  Crime and Punisment         1    NaN
2          4     unknown     Fathers and Sons         0    NaN
3          1     Pushkin        War and Peace         1    0.0

In [101]:
df4['index'].fillna(0, inplace = True)
df4

C:\Users\ramze\AppData\Local\Temp\ipykernel_2124\1346698635.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df4['index'].fillna(0, inplace = True)

   author_id author_name          books_title  quantity  index
0          2     Tolstoy            The Idiot         1    0.0
1          3  Dostoevsky  Crime and Punisment         1    0.0
2          4     unknown     Fathers and Sons         0    0.0
3          1     Pushkin        War and Peace         1    0.0

In [102]:
# удалим строку (index, axis=0 )
df4 = df4.drop(0, axis=0)
df4

   author_id author_name          books_title  quantity  index
1          3  Dostoevsky  Crime and Punisment         1    0.0
2          4     unknown     Fathers and Sons         0    0.0
3          1     Pushkin        War and Peace         1    0.0

сортируем по столбцу author_id

In [103]:
df4 = df4.sort_values(by = 'author_id')
df4

   author_id author_name          books_title  quantity  index
3          1     Pushkin        War and Peace         1    0.0
1          3  Dostoevsky  Crime and Punisment         1    0.0
2          4     unknown     Fathers and Sons         0    0.0

In [104]:
#упорядовачием индексы
df4 = df4.reset_index(drop = True)
df4

   author_id author_name          books_title  quantity  index
0          1     Pushkin        War and Peace         1    0.0
1          3  Dostoevsky  Crime and Punisment         1    0.0
2          4     unknown     Fathers and Sons         0    0.0

Создаие DataFrame

конкатинация по оси ноль добавления новых строк

In [105]:
df5 = pd.DataFrame({'author_id': [3,5], 'author_name': ['Dostoevsky', 'Chehov'],
                    'books_title' : ['The Gambler', 'Three Sisters'], 'quantity':[2, 3]},
                    columns = ['author_id', 'author_name', 'books_title', 'quantity'])
df5

   author_id author_name    books_title  quantity
0          3  Dostoevsky    The Gambler         2
1          5      Chehov  Three Sisters         3

In [106]:
df6 = pd.concat([df4, df5], axis=0, ignore_index=True)
df6

   author_id author_name          books_title  quantity  index
0          1     Pushkin        War and Peace         1    0.0
1          3  Dostoevsky  Crime and Punisment         1    0.0
2          4     unknown     Fathers and Sons         0    0.0
3          3  Dostoevsky          The Gambler         2    NaN
4          5      Chehov        Three Sisters         3    NaN

конкантинация по оси 1 столбцы

In [107]:
prices = pd.DataFrame({'price' : [700, 450, 500, 400, 350]}, columns=['price'], index=[1, 2, 3, 5, 6])
prices

   price
1    700
2    450
3    500
5    400
6    350

In [108]:
df7 = pd.concat([df6, prices], axis = 1)
df7

   author_id author_name          books_title  quantity  index  price
0        1.0     Pushkin        War and Peace       1.0    0.0    NaN
1        3.0  Dostoevsky  Crime and Punisment       1.0    0.0  700.0
2        4.0     unknown     Fathers and Sons       0.0    0.0  450.0
3        3.0  Dostoevsky          The Gambler       2.0    NaN  500.0
4        5.0      Chehov        Three Sisters       3.0    NaN    NaN
5        NaN         NaN                  NaN       NaN    NaN  400.0
6        NaN         NaN                  NaN       NaN    NaN  350.0

In [109]:
df7["total"] = df7["quantity"] * df7["price"]

df7

   author_id author_name          books_title  quantity  index  price   total
0        1.0     Pushkin        War and Peace       1.0    0.0    NaN     NaN
1        3.0  Dostoevsky  Crime and Punisment       1.0    0.0  700.0   700.0
2        4.0     unknown     Fathers and Sons       0.0    0.0  450.0     0.0
3        3.0  Dostoevsky          The Gambler       2.0    NaN  500.0  1000.0
4        5.0      Chehov        Three Sisters       3.0    NaN    NaN     NaN
5        NaN         NaN                  NaN       NaN    NaN  400.0     NaN
6        NaN         NaN                  NaN       NaN    NaN  350.0     NaN

С помощью следующих методов можно посчитать основные статистики по желаемым столбцам:

* `df4["price"].max()` - максимум
* `df4["price"].min()` - минимум
* `df4["price"].mean()` - среднее
* `df4["price"].median()` - медиана
* `df4["price"].std()` - среднее квадратическое значение
* `df4["price"].var()` - дисперсия

С помощью метода `.nlargest` можно вывести несколько наибольших значений. Указывается то, сколько значений нужно вернуть, а также то, по какому именно значению нужно сортировать:

In [110]:
df7.nlargest(3, "price")

   author_id author_name          books_title  quantity  index  price   total
1        3.0  Dostoevsky  Crime and Punisment       1.0    0.0  700.0   700.0
3        3.0  Dostoevsky          The Gambler       2.0    NaN  500.0  1000.0
2        4.0     unknown     Fathers and Sons       0.0    0.0  450.0     0.0

In [111]:
#аналогично
df7.nlargest(3, "price")

   author_id author_name          books_title  quantity  index  price   total
1        3.0  Dostoevsky  Crime and Punisment       1.0    0.0  700.0   700.0
3        3.0  Dostoevsky          The Gambler       2.0    NaN  500.0  1000.0
2        4.0     unknown     Fathers and Sons       0.0    0.0  450.0     0.0